<!DOCTYPE html>
<html lang = "ru">
<head>
  <meta charset="utf-8">
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  <meta http-equiv="X-UA-Compatible" content="ie=edge">
  <link rel="stylesheet" type="text/css" href="css/style.css">
  <link rel="stylesheet" type="text/css" href="https://stackpath.bootstrapcdn.com/bootstrap/4.5.0/css/bootstrap.min.css">
  <title>Главная</title>
  <style>
  body { background: url(img/16.jpg); }
</style>
</head>
<body>
  <?php require "blocks/header.php" ?>
    <div class="col-md-6 row bg-dark" style="margin-top: 10px; margin-left: 250px;" align="center">
    	<strong class="d-inline-block mb-2 container" style="color:#000000"><h2>Мой корпус</h2></strong>
  <a class="container" style="color:#ADD8E6"> Концепція підготовки фахівців передбачає, що випускник кафедри повинен мати необхідні знання та вміння для виконання повного циклу створення сучасних систем автоматизації для промисловості та АПК, у тому числі розробки технічного завдання, створення необхідних математичних моделей технологічних процесів, що керуються, складання алгоритмів програмного керування, оптимального вибору технічних засобів автоматизації, розробки структурних, принципових та монтажних електричних схем, розробки комплекту програмного забезпечення, виконання робіт з налагодження систем автоматизації у лабораторних та промислових умовах, а також впровадження їх у виробництво.
     На кафедрі викладаються такі дисципліни: теорія інформації, теорія автоматичного керування, теоретичні основи автоматики, ідентифікація та моделювання технологічних об'єктів, програмування систем реального часу, мікропроцесорні та програмні засоби автоматизації, технічні засоби автоматизації, автоматизовані системи керування технологічними процесами (АСКТП), основи систем автоматизованого проектування (САПР), проектування АСКТП с.-г. виробництва, комп'ютерні засоби систем точного землеробства, проектування цифрових пристроїв на ПЛІС, методологія наукових досліджень, теорія цифрових автоматів, патентознавство та інтелектуальна власність, інформаційні технології в енергетиці та промисловому виробництві, об'єктно-орієнтоване програмування, основи нечіткого логічного керування, нейронні системи та мережі.
     Кафедра має сучасну матеріально-технічну базу, яка складається з навчальних лабораторій: основ автоматики, мікропроцесорних програмованих керуючих пристроїв, інтегрованих комп'ютерних технологій, комп'ютерного моделювання та проектування, а також має сучасну лекційну аудиторію, оснащену мультимедійною інтерактивною дошкою та проектором.
   Всі навчальні лабораторії оснащені сучасними засобами комп'ютерної техніки та промислової автоматизації, а саме: 65 персональних комп'ютерів, які об'єднані у локальну мережу і підключені до Інтернету; різне периферійне обладнання, програмовані логічні контролери (ПЛК) промислового призначення різних фірм; пристрої та датчики систем автоматизації виробничих процесів.

Для проведення наукових досліджень викладачами та студентами використовується створена на кафедрі науково-дослідна лабораторія оснащена сучасними комп'ютерними та іншими технічними засобами автоматизації.

Навчально-методична база
По всіх дисциплінах, що викладаються на кафедрі, розроблені робочі програми, методичні вказівки до виконання курсових і, лабораторних робіт, практичних занять. Для більшості дисциплін, що викладаються на кафедрі використовуються підручники та навчальні посібники створені викладачами кафедри

Крім широко розповсюджених офісних пакетів прикладних програм на кафедрі використовуються на практиці такі пакети, як: КОМПАС, що дозволяє автоматизовано готувати повний комплект конструкторської документації на електрообладнання та збиральні одиниці механічних вузлів; Genie і Genesis32 - SCADA-пакети для автоматизованого проектування АСКТП; MAX+PLUS II - для автоматизованого проектування пристроїв обробки інформації та керування на основі ПЛІС.</a>
       <a href="https://www.electrofak.com.ua/index.php/uk/"  style="color:#F4A460" class="container"><h3>ННІ ЕКТ</h3></a>
 </div>
  <?php require "blocks/footer.php" ?>
</body>
</html>