<!DOCTYPE html>
<html lang = "ru">
<head>
  <meta charset="utf-8">
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  <meta http-equiv="X-UA-Compatible" content="ie=edge">
  <link rel="stylesheet" type="text/css" href="css/style.css">
  <link rel="stylesheet" type="text/css" href="https://stackpath.bootstrapcdn.com/bootstrap/4.5.0/css/bootstrap.min.css">
  <title>Главная</title>
  <style>
  body { background: url(img/17.jpg); }
</style>
</head>
<body>
  <?php require "blocks/header.php" ?>
  <div class="col-md-8 row bg-dark" style="margin-top: 10px; margin-left: 550px;" align="center">
    	<strong class="d-inline-block mb-1 container" style="color:#000000"><h2>Про кафедру</h2></strong>
  <a class="container" style="color:#ADD8E6"> Кафедра автоматизації та комп’ютерно-інтегрованих технологій створена у 2000 році на основі частини професорсько-викладацького складу кафедри кібернетики університету.

      Згідно наказу ректора університету від 30 грудня 2009 р. про упорядкування структури університету, було змінено назву кафедри на кафедру автоматизації комп’ютерно-інтегрованих технологій.

     На даний час професорсько-викладацький склад кафедри включає до себе як досвідчених, висококваліфікованих фахівців так і перспективних молодих викладачів та науковців.

     В період з 2000 р. по 2016 р. очолював кафедру відомий в Україні та за її межами вчений – спеціаліст у галузі створення архітектури та технології застосування програмованих контролерів промислового призначення, доктор технічних наук, професор, відмінник освіти України, академік Академії наук вищої освіти України Фурман Ілля Олександрович, який має великий досвід науково-дослідної роботи і впровадження у виробництво сучасних автоматизованих технологічних комплексів. Він є ініціатором і автором розробки робочої програми і методики викладання нової дисципліни “Мікропроцесорні керуючі пристрої”. За роки існування кафедри ним особисто та сумісно з викладачами кафедри підготовлено і надруковано 27 підручників і навчальних посібників із грифом Міносвіти, більше 300 статей, отримано 15 патентів України на винаходи. За вказаний період на кафедрі захищено три докторські та 6 кандидатських дисертації.

     В період з 2016 р. по 2018 р. очолював кафедру Піскарьов Олексій Миколайович. За цей період на кафедрі було суттєво оновлено лабораторне обладнання, модернізовано комп’ютерні класи, отримано ліцензію на спеціальність 123 – Комп’ютерна інженерія.

    З 2018 р. кафедру очолює доктор технічних наук, доцент Тимчук Сергій Олександрович.</a>
       <a href="http://khntusg.com.ua/department/kafedra-avtomatizacii-ta-komp-juterno-integrovanih-tehnologij/"  style="color:#F4A460" class="container"><h3>KI ЕКТ</h3></a>
 </div>

  <?php require "blocks/footer.php" ?>
</body>
</html>